# WorksetId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementWorksetFilter..::..WorksetId Property
ElementWorksetFilter Class See Also
---
The workset id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WorksetId WorksetId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WorksetId As WorksetId
	Get
```

Visual C++
---
```text
public:
property WorksetId^ WorksetId {
	WorksetId^ get ();
}
```

# See Also
ElementWorksetFilter Class
Autodesk.Revit.DB Namespace